{
  "name": "Aaron P. Sykes",
  "contactInfo": {
    "phoneNumber": "757.656.9152",
    "email": "aaron@aaronsykes.com",
    "website": "aaronsykes.com"
  },
  "skills": [
    "Python",
    "JavaScript",
    "TypeScript",
    "SQL"
  ],
  "education": [
    {
      "schoolName": "Virginia Tech",
      "schoolLocation": "Blacksburg, VA",
      "graduationDate": "May 2009",
      "degree": {
        "type": "B.S.",
        "majors": [
          "Economics",
          "Finance"
        ]
      }
    }
  ],
  "experience": [
    {
      "jobTitle": "Software Engineer/Senior Software Engineer",
      "company": "Airship",
      "location": "Portland, OR",
      "startDate": "Oct. 2014",
      "endDate": "present",
      "accomplishments": [
        "Developed numerous features for the customer dashboard using: Python, Django, DRF, Typescript, React",
        "Planned, developed, and oversaw the implementation of a third party OIDC auth provider for all customers",
        "Contributed to modernization efforts, including: Python 3 migration, TypeScript transition, database and web server upgrades",
        "Guided, and mentored fellow engineers in software development best practices",
        "Participated in the architecting and planning of features and projects for a team of engineers",
        "Developed, and maintained tooling for deploying and managing GCP, and AWS infrastructure"
      ]
    },
    {
      "jobTitle": "Web Developer",
      "company": "Atlatl Software",
      "location": "Portland, OR",
      "startDate": "August 2013",
      "endDate": "Sept. 2014",
      "accomplishments": [
        "Developed, and maintained a multi-tenanted web app with Python/Django, and Javascript",
        "Engaged in group code reviews, and pair programming with a small team of developers",
        "Utilized test-driven development methods by writing numerous automated unit and integration tests",
        "Built, and maintained web infastructure including: Nginx, PostgreSQL, and AWS"
      ]
    },
    {
      "jobTitle": "Web Analyst",
      "company": "Modea",
      "location": "Blacksburg, VA",
      "startDate": "October 2011",
      "endDate": "July 2013",
      "accomplishments": [
        "Designed and developed GAE web apps for displaying project health, and web traffic data using Python and JS",
        "Implemented numerous Google Analytics and Google Tag Manager JS deployments"
      ]
    },
    {
      "jobTitle": "Software Consultant",
      "company": "CSC",
      "location": "Falls Church, VA",
      "startDate": "June 2009",
      "endDate": "Oct. 2011",
      "accomplishments": [
        "Optimized a sales pipeline data analysis process using an enterprise database management system",
        "Facilitated the creation of a data warehouse of epidemiological data for the Veteran Health Administration"
      ]
    }
  ],
  "additionalInfo": "I'm a free and open software enthusiast, who's been using Linux for over 10 years."
}
