{
  "name": "Aaron P. Sykes",
  "contactInfo": {
    "address": "Portland, OR 97214",
    "phoneNumber": "757.656.9152",
    "email": "aaron@aaronsykes.com",
    "website": "aaronsykes.com"
  },
  "skills": [
    "Python",
    "SQL",
    "Bash",
    "JavaScript"
  ],
  "education": [
    {
      "schoolName": "Virginia Tech",
      "schoolLocation": "Blacksburg, VA",
      "graduationDate": "May 2009",
      "degree": {
        "type": "B.S.",
        "majors": [
          "Economics",
          "Finance"
        ]
      }
    }
  ],
  "experience": [
    {
      "jobTitle": "Software Engineer/Senior Software Engineer",
      "company": "Urban Airship",
      "location": "Portland, OR",
      "startDate": "Oct. 2014",
      "endDate": "present",
      "accomplishments": [
        "Maintained and optimized the customer dashboard Python/Django modules responsible for collecting, aggregating, and enriching customer usage data",
        "Designed, and developed HTTP/JSON APIs, and SQS queue workers for sending customer usage data to 3rd party cloud services",
        "Created tooling for deploying and managing the Business System team's AWS infrastructure using CloudFormation and Ansible",
        "Deprecated MongoDB, and migrated historical data to a PostgreSQL table with JSONB field",
        "Oversaw Transition of customer audience data collection for billing to a single RPC over Protobuf source"
        ]
      },
    {
      "jobTitle": "Web Developer",
      "company": "Atlatl Software",
      "location": "Portland, OR",
      "startDate": "August 2013",
      "endDate": "Sept. 2014",
      "accomplishments": [
        "Designed, developed, and maintained a multi-tenanted Python/Django  web app with JS/JQuery front-end",
        "Engaged in group code reviews, and pair programming with a small team of developers",
        "Utilized test-driven development methods by writing numerous automated unit and integration tests",
        "Managed, and optimized a service stack running Nginx, uWSGI, and PostgreSQL in AWS"
      ]
    },
    {
      "jobTitle": "Web Analyst",
      "company": "Modea",
      "location": "Blacksburg, VA",
      "startDate": "October 2011",
      "endDate": "July 2013",
      "accomplishments": [
        "Designed and developed GAE web apps for displaying project health, and web traffic data using Python and JS",
        "Implemented numerous Google Analytics and Google Tag Manager JS deployments"
      ]
    },
    {
      "jobTitle": "Software Consultant",
      "company": "CSC",
      "location": "Falls Church, VA",
      "startDate": "June 2009",
      "endDate": "Oct. 2011",
      "accomplishments": [
        "Reduced the time required to perform a weekly analysis of the business opportunity pipeline using an enterprise Database Management System",
        "Facilitated the movement of medical records from servers at various Veteran Health Administration data hubs to a single data warehouse"
      ]
    }
  ],
  "additionalInfo": "I've maintained a personal Linux desktop (currently ubuntu 18.04) for years. I use Git for nearly everything. I've had experience with: JSON, HTML5, CSS, XML, YAML."
}
